app/Controllers/AdminController.php

SELECT *
FROM `balance`
WHERE `id` IN (1,2)
---
    public function index()
    {
        $data = [
            'balanceData' => $this->ModelBalance->whereIn('id', [1, 2])->findAll(),
        ];