app/Controllers/CategoryController.php

SELECT *
FROM `category`
---
    public function index()
    {
        $data = [
            'categoryData' => $this->ModelCategory->findAll(),
        ];