app/Controllers/ExpenseController.php

    public function index()
    {
        $query = $this->ModelExpense
        ->select('expense.id, expense.date, balance.title_balance, category.name_category, expense.amount, unit.name_unit, type.name_type, expense.name_expense')
        ->join('balance', 'balance.id = expense.balance_id')
        ->join('category', 'category.id = expense.category_id')
        ->join('unit', 'unit.id = expense.unit_id')
        ->join('type', 'type.id = expense.type_id')
        ->findAll();
---
SELECT `expense`.`id`, `expense`.`date`, `balance`.`title_balance`, `category`.`name_category`, `expense`.`amount`, `unit`.`name_unit`, `type`.`name_type`, `expense`.`name_expense`
FROM `expense`
JOIN `balance` ON `balance`.`id` = `expense`.`balance_id`
JOIN `category` ON `category`.`id` = `expense`.`category_id`
JOIN `unit` ON `unit`.`id` = `expense`.`unit_id`
JOIN `type` ON `type`.`id` = `expense`.`type_id`

    public function create()
    {
        $data = [
            "balanceData" => $this->ModelBalance->findAll(),
            "categoryData" => $this->ModelCategory->findAll(),
            "unitData" => $this->ModelUnit->findAll(),
            "typeData" => $this->ModelType->findAll(),
        ];
---
SELECT *
FROM `balance`
SELECT *
FROM `category`
SELECT *
FROM `unit`
SELECT *
FROM `type`

    public function store()
    {
        $data = [
            'date' => $this->request->getPost('date'),
            'hour' => $this->request->getPost('hour'),
            'balance_id' => $this->request->getPost('balance_id'),
            'category_id' => $this->request->getPost('category_id'),
            'amount' => $this->request->getPost('amount'),
            'unit_id' => $this->request->getPost('unit_id'),
            'type_id' => $this->request->getPost('type_id'),
            'name_expense' => $this->request->getPost('name_expense'),
            'expense_detail' => $this->request->getPost('expense_detail'),
        ];

        $balance = $this->ModelBalance->find($data['balance_id']);
        $trigger_amount['amount'] = $balance['amount'] - $data['amount'];
        $this->ModelExpense->insert($data);
        $this->ModelBalance->update($data['balance_id'],$trigger_amount);
---
SELECT *
FROM `balance`
WHERE `balance`.`id` = '1'
INSERT INTO `expense` (`date`, `hour`, `balance_id`, `category_id`, `amount`, `unit_id`, `type_id`, `name_expense`, `expense_detail`) VALUES ('2023-09-03', '10:26', '1', '2', '10000', '2', '3', 'Coba', 'Coba Coba')
UPDATE `balance` SET `amount` = 690000
WHERE `balance`.`id` IN ('1')

    public function edit($id)
    {
        $data = [
            "balanceData" => $this->ModelBalance->findAll(),
            "categoryData" => $this->ModelCategory->findAll(),
            "unitData" => $this->ModelUnit->findAll(),
            "typeData" => $this->ModelType->findAll(),
            "expense" => $this->ModelExpense->find($id),
        ];
---
SELECT *
FROM `balance`
SELECT *
FROM `category`
SELECT *
FROM `unit`
SELECT *
FROM `type`
SELECT *
FROM `expense`
WHERE `expense`.`id` = '2'

    public function update($id)
    {
        $data = [
            'date' => $this->request->getPost('date'),
            'hour' => $this->request->getPost('hour'),
            'balance_id' => $this->request->getPost('balance_id'),
            'category_id' => $this->request->getPost('category_id'),
            'amount' => $this->request->getPost('amount'),
            'unit_id' => $this->request->getPost('unit_id'),
            'type_id' => $this->request->getPost('type_id'),
            'name_expense' => $this->request->getPost('name_expense'),
            'expense_detail' => $this->request->getPost('expense_detail'),
        ];

        $expense = $this->ModelExpense->find($id);

        if ($expense['balance_id'] == $data['balance_id']) {
            $balance = $this->ModelBalance->find($data['balance_id']);
            if ($expense['amount'] > $data['amount']){
                $trigger_amount['amount'] = $balance['amount'] + ($expense['amount'] - $data['amount']);
            }
            elseif($expense['amount'] < $data['amount']){
                $trigger_amount['amount'] = $balance['amount'] - ( $data['amount'] - $expense['amount']);
            }
            elseif($expense['amount'] == $data['amount']){
                $trigger_amount['amount'] = $balance['amount'];
            }
        }
        else {
            $balance = $this->ModelBalance->find($data['balance_id']);
            $balance2 = $this->ModelBalance->find($expense['balance_id']);
            $remove_trigger['amount'] = $balance2['amount'] + $expense['amount'];
            $this->ModelBalance->update($expense['balance_id'],$remove_trigger);
            $trigger_amount['amount'] = $balance['amount'] - $data['amount'];
        }

        $this->ModelExpense->update($id, $data);
        $this->ModelBalance->update($data['balance_id'],$trigger_amount);
---
SELECT *
FROM `expense`
WHERE `expense`.`id` = '2'
SELECT *
FROM `balance`
WHERE `balance`.`id` = '1'
SELECT *
FROM `balance`
WHERE `balance`.`id` = '2'
UPDATE `balance` SET `amount` = 700000
WHERE `balance`.`id` IN ('1')
UPDATE `expense` SET `date` = '2023-09-02', `hour` = '15:32', `balance_id` = '2', `category_id` = '1', `amount` = '50000', `unit_id` = '2', `type_id` = '3', `name_expense` = 'Mencoba4', `expense_detail` = 'Mencoba4'
WHERE `expense`.`id` IN ('2')
UPDATE `balance` SET `amount` = 250000
WHERE `balance`.`id` IN ('2')