app/Controllers/UnitController.php

    public function index()
    {
        $data = [
            'unitData' => $this->ModelUnit->findAll(),
        ];
---
SELECT *
FROM `unit`